ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_timer.h
/**
  ******************************************************************************
  * @file    MDR32FxQI_timer.h
  * @author  Milandr Application Team
  * @version V2.0.0i
  * @date    14/03/2022
  * @brief   This file contains all the functions prototypes for the TIMER
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FxQI_TIMER_H
#define __MDR32FxQI_TIMER_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

/** @addtogroup TIMER
  * @{
  */

/** @defgroup TIMER_Exported_Types TIMER Exported Types
  * @{
  */

/**
  * @brief TIMER Counter Mode
  */
typedef enum
{
    TIMER_CntMode_ClkFixedDir  = (((uint32_t)0x0) << TIMER_CNTRL_CNT_MODE_Pos), /*!< The Timer clock changes the TIMERx_CNT value. The count direction is not changed. */
    TIMER_CntMode_ClkChangeDir = (((uint32_t)0x1) << TIMER_CNTRL_CNT_MODE_Pos), /*!< The Timer clock changes the TIMERx_CNT value. The count direction changes. */
    TIMER_CntMode_EvtFixedDir  = (((uint32_t)0x2) << TIMER_CNTRL_CNT_MODE_Pos), /*!< The event changes the TIMERx_CNT value. The count direction is not changed. */
    TIMER_CntMode_EvtChangeDir = (((uint32_t)0x3) << TIMER_CNTRL_CNT_MODE_Pos)  /*!< The event changes the TIMERx_CNT value. The count direction changes. */
} TIMER_Counter_Mode_TypeDef;

#define IS_TIMER_COUNTER_MODE(MODE) (((MODE) == TIMER_CntMode_ClkFixedDir ) || \
                                     ((MODE) == TIMER_CntMode_ClkChangeDir) || \
                                     ((MODE) == TIMER_CntMode_EvtFixedDir ) || \
                                     ((MODE) == TIMER_CntMode_EvtChangeDir))

/**
  * @brief TIMER Counter Direction
  */
typedef enum
{
    TIMER_CntDir_Up = (((uint32_t)0x0) << TIMER_CNTRL_DIR_Pos), /*!< Increments the Timer TIMERx_CNT counter value. */
    TIMER_CntDir_Dn = (((uint32_t)0x1) << TIMER_CNTRL_DIR_Pos)  /*!< Decrements the Timer TIMERx_CNT counter value. */
} TIMER_Counter_Dir_TypeDef;

#define IS_TIMER_COUNTER_DIR(DIR) (((DIR) == TIMER_CntDir_Up) || \
                                   ((DIR) == TIMER_CntDir_Dn))

/**
  * @brief TIMER Event Source
  */
typedef enum
{
    TIMER_EvSrc_TIM_CLK = (((uint32_t)0x0) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects rising edge TIM_CLK event. */
    TIMER_EvSrc_TM1     = (((uint32_t)0x1) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects TIMER1 (CNT == ARR) event. */
    TIMER_EvSrc_TM2     = (((uint32_t)0x2) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects TIMER2 (CNT == ARR) event. */
    TIMER_EvSrc_TM3     = (((uint32_t)0x3) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects TIMER3 (CNT == ARR) event. */
    TIMER_EvSrc_CH1     = (((uint32_t)0x4) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects Channel 1 event. */
    TIMER_EvSrc_CH2     = (((uint32_t)0x5) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects Channel 2 event. */
    TIMER_EvSrc_CH3     = (((uint32_t)0x6) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects Channel 3 event. */
    TIMER_EvSrc_CH4     = (((uint32_t)0x7) << TIMER_CNTRL_EVENT_SEL_Pos), /*!< Selects Channel 4 event. */
    TIMER_EvSrc_ETR     = (((uint32_t)0x8) << TIMER_CNTRL_EVENT_SEL_Pos)  /*!< Selects ETR event. */
} TIMER_Event_Src_TypeDef;

#define IS_TIMER_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_EvSrc_TIM_CLK) || \
                                       ((SOURCE) == TIMER_EvSrc_TM1 )    || \
                                       ((SOURCE) == TIMER_EvSrc_TM2 )    || \
                                       ((SOURCE) == TIMER_EvSrc_TM3 )    || \
                                       ((SOURCE) == TIMER_EvSrc_CH1 )    || \
                                       ((SOURCE) == TIMER_EvSrc_CH2 )    || \
                                       ((SOURCE) == TIMER_EvSrc_CH3 )    || \
                                       ((SOURCE) == TIMER_EvSrc_CH4 )    || \
                                       ((SOURCE) == TIMER_EvSrc_ETR ))

/**
  * @brief TIMER Filter Sampling Clock
  */
typedef enum
{
    TIMER_FDTS_TIMER_CLK_div_1 = (((uint32_t)0x0) << TIMER_CNTRL_FDTS_Pos), /*!< The FDTS clock occures each TIMER_CLK clock. */
    TIMER_FDTS_TIMER_CLK_div_2 = (((uint32_t)0x1) << TIMER_CNTRL_FDTS_Pos), /*!< The FDTS clock occures each 2-nd TIMER_CLK clock. */
    TIMER_FDTS_TIMER_CLK_div_3 = (((uint32_t)0x2) << TIMER_CNTRL_FDTS_Pos), /*!< The FDTS clock occures each 3-rd TIMER_CLK clock. */
    TIMER_FDTS_TIMER_CLK_div_4 = (((uint32_t)0x3) << TIMER_CNTRL_FDTS_Pos)  /*!< The FDTS clock occures each 4-th TIMER_CLK clock. */
} TIMER_Filter_Sampl_Clk_TypeDef;

#define IS_TIMER_FILTER_SAMPLING(CONFIG) (((CONFIG) == TIMER_FDTS_TIMER_CLK_div_1) || \
                                          ((CONFIG) == TIMER_FDTS_TIMER_CLK_div_2) || \
                                          ((CONFIG) == TIMER_FDTS_TIMER_CLK_div_3) || \
                                          ((CONFIG) == TIMER_FDTS_TIMER_CLK_div_4))

/**
  * @brief TIMER ARR Update Mode
  */
typedef enum
{
    TIMER_ARR_Update_Immediately     =  (((uint32_t)0x0) << TIMER_CNTRL_ARRB_EN_Pos), /*!< The ARR register is updated immediately. */
    TIMER_ARR_Update_On_CNT_Overflow =  (((uint32_t)0x1) << TIMER_CNTRL_ARRB_EN_Pos)  /*!< The ARR register is updated at CNT count end. */
} TIMER_ARR_Update_Mode_TypeDef;

#define IS_TIMER_ARR_UPDATE_MODE(MODE) (((MODE) == TIMER_ARR_Update_Immediately) || \
                                        ((MODE) == TIMER_ARR_Update_On_CNT_Overflow))

/**
  * @brief TIMER Filter configuration
  */
typedef enum
{
    TIMER_Filter_1FF_at_TIMER_CLK   = ((uint32_t)0x0), /*!< Signal is latched by 1 trigger  at TIMER_CLK clock frequency. */
    TIMER_Filter_2FF_at_TIMER_CLK   = ((uint32_t)0x1), /*!< Signal is latched by 2 triggers at TIMER_CLK clock frequency. */
    TIMER_Filter_4FF_at_TIMER_CLK   = ((uint32_t)0x2), /*!< Signal is latched by 4 triggers at TIMER_CLK clock frequency. */
    TIMER_Filter_8FF_at_TIMER_CLK   = ((uint32_t)0x3), /*!< Signal is latched by 8 triggers at TIMER_CLK clock frequency. */
    TIMER_Filter_6FF_at_FTDS_div_2  = ((uint32_t)0x4), /*!< Signal is latched by 6 triggers at FDTS/2  clock frequency. */
    TIMER_Filter_8FF_at_FTDS_div_2  = ((uint32_t)0x5), /*!< Signal is latched by 8 triggers at FDTS/2  clock frequency. */
    TIMER_Filter_6FF_at_FTDS_div_4  = ((uint32_t)0x6), /*!< Signal is latched by 6 triggers at FDTS/4  clock frequency. */
    TIMER_Filter_8FF_at_FTDS_div_4  = ((uint32_t)0x7), /*!< Signal is latched by 8 triggers at FDTS/4  clock frequency. */
    TIMER_Filter_6FF_at_FTDS_div_8  = ((uint32_t)0x8), /*!< Signal is latched by 6 triggers at FDTS/8  clock frequency. */
    TIMER_Filter_8FF_at_FTDS_div_8  = ((uint32_t)0x9), /*!< Signal is latched by 8 triggers at FDTS/8  clock frequency. */
    TIMER_Filter_5FF_at_FTDS_div_16 = ((uint32_t)0xA), /*!< Signal is latched by 5 triggers at FDTS/16 clock frequency. */
    TIMER_Filter_6FF_at_FTDS_div_16 = ((uint32_t)0xB), /*!< Signal is latched by 6 triggers at FDTS/16 clock frequency. */
    TIMER_Filter_8FF_at_FTDS_div_16 = ((uint32_t)0xC), /*!< Signal is latched by 8 triggers at FDTS/16 clock frequency. */
    TIMER_Filter_5FF_at_FTDS_div_32 = ((uint32_t)0xD), /*!< Signal is latched by 5 triggers at FDTS/32 clock frequency. */
    TIMER_Filter_6FF_at_FTDS_div_32 = ((uint32_t)0xE), /*!< Signal is latched by 6 triggers at FDTS/32 clock frequency. */
    TIMER_Filter_8FF_at_FTDS_div_32 = ((uint32_t)0xF)  /*!< Signal is latched by 8 triggers at FDTS/32 clock frequency. */
} TIMER_Filter_Config_TypeDef;

