ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_timer.h
#define IS_TIMER_FILTER_CONF(CONF) (((CONF) == TIMER_Filter_1FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_2FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_4FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_TIMER_CLK  ) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_2 ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_2 ) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_4 ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_4 ) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_8 ) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_8 ) || \
                                    ((CONF) == TIMER_Filter_5FF_at_FTDS_div_16) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_16) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_16) || \
                                    ((CONF) == TIMER_Filter_5FF_at_FTDS_div_32) || \
                                    ((CONF) == TIMER_Filter_6FF_at_FTDS_div_32) || \
                                    ((CONF) == TIMER_Filter_8FF_at_FTDS_div_32))

/**
  * @brief TIMER ETR Prescaler
  */
typedef enum
{
    TIMER_ETR_Prescaler_None  = (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos), /*!< No division of input frequency. */
    TIMER_ETR_Prescaler_div_2 = (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos), /*!< Selects input frequency divider by 2. */
    TIMER_ETR_Prescaler_div_4 = (((uint32_t)0x2) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos), /*!< Selects input frequency divider by 4. */
    TIMER_ETR_Prescaler_div_8 = (((uint32_t)0x3) << TIMER_BRKETR_CNTRL_ETR_PSC_Pos)  /*!< Selects input frequency divider by 8. */
} TIMER_ETR_Prescaler_TypeDef;

#define IS_TIMER_ETR_PRESCALER(VALUE) (((VALUE) == TIMER_ETR_Prescaler_None ) || \
                                       ((VALUE) == TIMER_ETR_Prescaler_div_2) || \
                                       ((VALUE) == TIMER_ETR_Prescaler_div_4) || \
                                       ((VALUE) == TIMER_ETR_Prescaler_div_8))

/**
  * @brief TIMER ETR Polarity
  */
typedef enum
{
   TIMER_ETRPolarity_NonInverted = (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_ETR_INV_Pos), /*!< No inversion of the ETR input. */
   TIMER_ETRPolarity_Inverted    = (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_ETR_INV_Pos)  /*!< The ETR input is inverted. */
} TIMER_ETR_Polarity_TypeDef;

#define IS_TIMER_ETR_POLARITY(STATE) (((STATE) == TIMER_ETRPolarity_NonInverted) || \
                                      ((STATE) == TIMER_ETRPolarity_Inverted   ))

/**
  * @brief TIMER BRK Polarity
  */
typedef enum
{
    TIMER_BRKPolarity_NonInverted = (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_BRK_INV_Pos), /*!< No inversion of the BRK input. */
    TIMER_BRKPolarity_Inverted    = (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_BRK_INV_Pos)  /*!< The BRK input is inverted. */
} TIMER_BRK_Polarity_TypeDef;

#define IS_TIMER_BRK_POLARITY(STATE) (((STATE) == TIMER_BRKPolarity_NonInverted) || \
                                      ((STATE) == TIMER_BRKPolarity_Inverted   ))

/**
  * @brief TIMER Channel Number
  */
typedef enum
{
    TIMER_CHANNEL1 = ((uint32_t)0x0), /*!< Specifies the TIMER channel 1. */
    TIMER_CHANNEL2 = ((uint32_t)0x1), /*!< Specifies the TIMER channel 2. */
    TIMER_CHANNEL3 = ((uint32_t)0x2), /*!< Specifies the TIMER channel 3. */
    TIMER_CHANNEL4 = ((uint32_t)0x3)  /*!< Specifies the TIMER channel 4. */
} TIMER_Channel_Number_TypeDef;

#define IS_TIMER_CHANNEL_NUMBER(NUMBER) (((NUMBER) == TIMER_CHANNEL1) || \
                                         ((NUMBER) == TIMER_CHANNEL2) || \
                                         ((NUMBER) == TIMER_CHANNEL3) || \
                                         ((NUMBER) == TIMER_CHANNEL4))

/**
  * @brief TIMER Channel Mode
  */
typedef enum
{
    TIMER_CH_MODE_PWM     = (((uint32_t)0x0) << TIMER_CH_CNTRL_CAP_NPWM_Pos), /*!< Specifies the PWM channel mode. */
    TIMER_CH_MODE_CAPTURE = (((uint32_t)0x1) << TIMER_CH_CNTRL_CAP_NPWM_Pos)  /*!< Specifies the Capture channel mode. */
} TIMER_CH_Mode_TypeDef;

#define IS_TIMER_CHANNEL_MODE(MODE) (((MODE) == TIMER_CH_MODE_PWM) || \
                                     ((MODE) == TIMER_CH_MODE_CAPTURE))

/**
  * @brief TIMER Channel ETR Reset configuration
  */
typedef enum
{
    TIMER_CH_ETR_RESET_Disable = (((uint32_t)0x0) << TIMER_CH_CNTRL_ETREN_Pos), /*!< Disables ETR Reset. */
    TIMER_CH_ETR_RESET_Enable  = (((uint32_t)0x1) << TIMER_CH_CNTRL_ETREN_Pos)  /*!< Enables ETR Reset. */
} TIMER_CH_ETR_RESET_TypeDef;

#define IS_TIMER_CHANNEL_ETR_RESET_CONFIG(CONFIG) (((CONFIG) == TIMER_CH_ETR_RESET_Disable) || \
                                                   ((CONFIG) == TIMER_CH_ETR_RESET_Enable ))

/**
  * @brief TIMER Channel BRK Reset configuration
  */
typedef enum
{
    TIMER_CH_BRK_RESET_Disable = (((uint32_t)0x0) << TIMER_CH_CNTRL_BRKEN_Pos), /*!< Disables BRK Reset. */
    TIMER_CH_BRK_RESET_Enable  = (((uint32_t)0x1) << TIMER_CH_CNTRL_BRKEN_Pos)  /*!< Enables BRK Reset. */
} TIMER_CH_BRK_RESET_TypeDef;

#define IS_TIMER_CHANNEL_BRK_RESET_CONFIG(CONFIG) (((CONFIG) == TIMER_CH_BRK_RESET_Disable) || \
                                                   ((CONFIG) == TIMER_CH_BRK_RESET_Enable ))

/**
  * @brief TIMER Channel REF Format
  */
typedef enum
{
    TIMER_CH_REF_Format0 = (((uint32_t)0x0) << TIMER_CH_CNTRL_OCCM_Pos), /*!< REF is equal to 0 */
    TIMER_CH_REF_Format1 = (((uint32_t)0x1) << TIMER_CH_CNTRL_OCCM_Pos), /*!< REF is equal to 1 if:
                                                                             (CNT == CCR) or
                                                                             ((CNT == CCR1) and CCR1 enabled),
                                                                             else REF is equal to 0. */
    TIMER_CH_REF_Format2 = (((uint32_t)0x2) << TIMER_CH_CNTRL_OCCM_Pos), /*!< REF is equal to 0 if:
                                                                              (CNT == CCR) or
                                                                              ((CNT == CCR1) and CCR1 enabled),
                                                                              else REF is equal to 1. */
    TIMER_CH_REF_Format3 = (((uint32_t)0x3) << TIMER_CH_CNTRL_OCCM_Pos), /*!< Toggle REF state if:
                                                                              (CNT == CCR) or
                                                                              ((CNT == CCR1) and CCR1 enabled). */
    TIMER_CH_REF_Format4 = (((uint32_t)0x4) << TIMER_CH_CNTRL_OCCM_Pos), /*!< REF is equal to 0. */
    TIMER_CH_REF_Format5 = (((uint32_t)0x5) << TIMER_CH_CNTRL_OCCM_Pos), /*!< REF is equal to 1. */
    TIMER_CH_REF_Format6 = (((uint32_t)0x6) << TIMER_CH_CNTRL_OCCM_Pos), /*!< REF is equal to inverted DIR state if:
                                                                              (CCR1 disabled and (CNT < CCR)) or
                                                                              (CCR1 enabled  and (CCR < CNT < CCR1 ) (if CCR1 > CCR)),
                                                                              else REF is equal to DIR state. */
    TIMER_CH_REF_Format7 = (((uint32_t)0x7) << TIMER_CH_CNTRL_OCCM_Pos)  /*!< REF is equal to DIR state if:
                                                                              (CCR1 disabled and (CNT < CCR)) or
                                                                              (CCR1 enabled  and (CCR < CNT < CCR1 ) (if CCR1 > CCR)),
                                                                              else REF is equal to inverted DIR state. */
} TIMER_CH_REF_Format_TypeDef;

