ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_timer.h
#define IS_TIMER_CHANNEL_REF_FORMAT(FORMAT) (((FORMAT) == TIMER_CH_REF_Format0) || \
                                             ((FORMAT) == TIMER_CH_REF_Format1) || \
                                             ((FORMAT) == TIMER_CH_REF_Format2) || \
                                             ((FORMAT) == TIMER_CH_REF_Format3) || \
                                             ((FORMAT) == TIMER_CH_REF_Format4) || \
                                             ((FORMAT) == TIMER_CH_REF_Format5) || \
                                             ((FORMAT) == TIMER_CH_REF_Format6) || \
                                             ((FORMAT) == TIMER_CH_REF_Format7))

/**
  * @brief TIMER Channel Prescaler
  */
typedef enum
{
    TIMER_CH_Prescaler_None  = ((uint32_t)0x0), /*!< No division of input frequency. */
    TIMER_CH_Prescaler_div_2 = ((uint32_t)0x1), /*!< Selects input frequency divider by 2. */
    TIMER_CH_Prescaler_div_4 = ((uint32_t)0x2), /*!< Selects input frequency divider by 4. */
    TIMER_CH_Prescaler_div_8 = ((uint32_t)0x3)  /*!< Selects input frequency divider by 8. */
} TIMER_CH_Prescaler_TypeDef;

#define IS_TIMER_CHANNEL_PRESCALER(VALUE) (((VALUE) == TIMER_CH_Prescaler_None ) || \
                                           ((VALUE) == TIMER_CH_Prescaler_div_2) || \
                                           ((VALUE) == TIMER_CH_Prescaler_div_4) || \
                                           ((VALUE) == TIMER_CH_Prescaler_div_8))

/**
  * @brief TIMER Channel Event Source
  */
typedef enum
{
    TIMER_CH_EvSrc_PE     = (((uint32_t)0x0) << TIMER_CH_CNTRL_CHSEL_Pos), /*!< Selects positive edge from current TIMER channel. */
    TIMER_CH_EvSrc_NE     = (((uint32_t)0x1) << TIMER_CH_CNTRL_CHSEL_Pos), /*!< Selects negative edge from current TIMER channel. */
    TIMER_CH_EvSrc_PE_OC1 = (((uint32_t)0x2) << TIMER_CH_CNTRL_CHSEL_Pos), /*!< Selects positive edge from other TIMER channel (variant 1). */
    TIMER_CH_EvSrc_PE_OC2 = (((uint32_t)0x3) << TIMER_CH_CNTRL_CHSEL_Pos)  /*!< Selects positive edge from other TIMER channel (variant 2). */
} TIMER_CH_Event_Src_TypeDef;

#define IS_TIMER_CHANNEL_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_EvSrc_PE    ) || \
                                               ((SOURCE) == TIMER_CH_EvSrc_NE    ) || \
                                               ((SOURCE) == TIMER_CH_EvSrc_PE_OC1) || \
                                               ((SOURCE) == TIMER_CH_EvSrc_PE_OC2))

/**
  * @brief TIMER Channel CCR1 Event Source
  */
typedef enum
{
    TIMER_CH_CCR1EvSrc_PE     = (((uint32_t)0x0) << TIMER_CH_CNTRL2_CHSEL1_Pos), /*!< Selects positive edge from current TIMER channel. */
    TIMER_CH_CCR1EvSrc_NE     = (((uint32_t)0x1) << TIMER_CH_CNTRL2_CHSEL1_Pos), /*!< Selects negative edge from current TIMER channel. */
    TIMER_CH_CCR1EvSrc_NE_OC1 = (((uint32_t)0x2) << TIMER_CH_CNTRL2_CHSEL1_Pos), /*!< Selects negative edge from other TIMER channel (variant 1). */
    TIMER_CH_CCR1EvSrc_NE_OC2 = (((uint32_t)0x3) << TIMER_CH_CNTRL2_CHSEL1_Pos)  /*!< Selects negative edge from other TIMER channel (variant 2). */
} TIMER_CH_CCR1_Event_Src_TypeDef;

#define IS_TIMER_CHANNEL_CCR1_EVENT_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_CCR1EvSrc_PE    ) || \
                                                    ((SOURCE) == TIMER_CH_CCR1EvSrc_NE    ) || \
                                                    ((SOURCE) == TIMER_CH_CCR1EvSrc_NE_OC1) || \
                                                    ((SOURCE) == TIMER_CH_CCR1EvSrc_NE_OC2))

/**
  * @brief TIMER CCR, CCR1 Update mode
  */
typedef enum
{
    TIMER_CH_CCR_Update_Immediately = (((uint32_t)0x0) << TIMER_CH_CNTRL2_CCRRLD_Pos), /*!< The CCR, CCR1 registers is updated immediately. */
    TIMER_CH_CCR_Update_On_CNT_eq_0 = (((uint32_t)0x1) << TIMER_CH_CNTRL2_CCRRLD_Pos)  /*!< The CCR, CCR1 registers is updated at (CNT == 0) condition. */
} TIMER_CH_CCR_Update_Mode_TypeDef;

#define IS_TIMER_CHANNEL_CCR_UPDATE_MODE(MODE) (((MODE) == TIMER_CH_CCR_Update_Immediately) || \
                                                ((MODE) == TIMER_CH_CCR_Update_On_CNT_eq_0))

/**
  * @brief TIMER Channel Output Polarity
  */
typedef enum
{
    TIMER_CHOPolarity_NonInverted = ((uint32_t)0x0), /*!< No inversion on the Channel output. */
    TIMER_CHOPolarity_Inverted    = ((uint32_t)0x1)  /*!< The Channel output is inverted. */
} TIMER_CH_OUT_Polarity_TypeDef;

#define IS_TIMER_CHO_POLARITY(STATE) (((STATE) == TIMER_CHOPolarity_NonInverted) || \
                                      ((STATE) == TIMER_CHOPolarity_Inverted   ))

/**
  * @brief TIMER Channel Output Source
  */
typedef enum
{
    TIMER_CH_OutSrc_Only_0 = ((uint32_t)0x0), /*!< Selects the '0' state on the CHx (or CHxN) line. */
    TIMER_CH_OutSrc_Only_1 = ((uint32_t)0x1), /*!< Selects the '1' state on the CHx (or CHxN) line. */
    TIMER_CH_OutSrc_REF    = ((uint32_t)0x2), /*!< Selects the REF state on the CHx (or CHxN) line. */
    TIMER_CH_OutSrc_DTG    = ((uint32_t)0x3)  /*!< Selects the DTG output state on the CHx (or CHxN) line. */
} TIMER_CH_OUT_Src_TypeDef;

#define IS_TIMER_CHO_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_OutSrc_Only_0) || \
                                     ((SOURCE) == TIMER_CH_OutSrc_Only_1) || \
                                     ((SOURCE) == TIMER_CH_OutSrc_REF   ) || \
                                     ((SOURCE) == TIMER_CH_OutSrc_DTG   ))

/**
  * @brief TIMER Channel Output Mode
  */
typedef enum
{
    TIMER_CH_OutMode_Input     = ((uint32_t)0x0), /*!< Selects the Input mode on the CHx (or CHxN) line. */
    TIMER_CH_OutMode_Output    = ((uint32_t)0x1), /*!< Selects the Output mode on the CHx (or CHxN) line. */
    TIMER_CH_OutMode_REF_as_OE = ((uint32_t)0x2), /*!< The REF signal specifies the CHx (or CHxN) line mode. */
    TIMER_CH_OutMode_DTG_as_OE = ((uint32_t)0x3)  /*!< The DTG output specifies the CHx (or CHxN) line mode. */
} TIMER_CH_OUT_Mode_TypeDef;

#define IS_TIMER_CHO_MODE(MODE) (((MODE) == TIMER_CH_OutMode_Input    ) || \
                                 ((MODE) == TIMER_CH_OutMode_Output   ) || \
                                 ((MODE) == TIMER_CH_OutMode_REF_as_OE) || \
                                 ((MODE) == TIMER_CH_OutMode_DTG_as_OE))

/**
  * @brief TIMER Channel DTG Clock Source
  */
typedef enum
{
    TIMER_CH_DTG_ClkSrc_TIMER_CLK = (((uint32_t)0x0) << TIMER_CH_DTG_EDTS_Pos), /*!< Specifies the TIMER_CLK signal as DTG clock source. */
    TIMER_CH_DTG_ClkSrc_FDTS      = (((uint32_t)0x1) << TIMER_CH_DTG_EDTS_Pos)  /*!< Specifies the FDTS signal as DTG clock source. */
} TIMER_CH_DTG_Clk_Src_TypeDef;

