ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_timer.h
#define IS_TIMER_CHANNEL_DTG_CLK_SOURCE(SOURCE) (((SOURCE) == TIMER_CH_DTG_ClkSrc_TIMER_CLK) || \
                                                 ((SOURCE) == TIMER_CH_DTG_ClkSrc_FDTS     ))

/**
  * @brief TIMER Status flags
  */
typedef enum
{
    TIMER_STATUS_CNT_ZERO         = (((uint32_t)0x1) <<  0), /*!< The (CNT == 0) condition occured. */
    TIMER_STATUS_CNT_ARR          = (((uint32_t)0x1) <<  1), /*!< The (CNT == ARR) condition occured. */
    TIMER_STATUS_ETR_RISING_EDGE  = (((uint32_t)0x1) <<  2), /*!< The ETR rising edge occured. */
    TIMER_STATUS_ETR_FALLING_EDGE = (((uint32_t)0x1) <<  3), /*!< The ETR falling edge occured. */
    TIMER_STATUS_BRK              = (((uint32_t)0x1) <<  4), /*!< The (BRK == 1) condition occured. */
    TIMER_STATUS_CCR_CAP_CH1      = (((uint32_t)0x1) <<  5), /*!< The Channel 1 CCR capture condition occured. */
    TIMER_STATUS_CCR_CAP_CH2      = (((uint32_t)0x1) <<  6), /*!< The Channel 2 CCR capture condition occured. */
    TIMER_STATUS_CCR_CAP_CH3      = (((uint32_t)0x1) <<  7), /*!< The Channel 3 CCR capture condition occured. */
    TIMER_STATUS_CCR_CAP_CH4      = (((uint32_t)0x1) <<  8), /*!< The Channel 4 CCR capture condition occured. */
    TIMER_STATUS_CCR_REF_CH1      = (((uint32_t)0x1) <<  9), /*!< The Channel 1 (REF == 1) condition occured. */
    TIMER_STATUS_CCR_REF_CH2      = (((uint32_t)0x1) << 10), /*!< The Channel 2 (REF == 1) condition occured. */
    TIMER_STATUS_CCR_REF_CH3      = (((uint32_t)0x1) << 11), /*!< The Channel 3 (REF == 1) condition occured. */
    TIMER_STATUS_CCR_REF_CH4      = (((uint32_t)0x1) << 12), /*!< The Channel 4 (REF == 1) condition occured. */
    TIMER_STATUS_CCR_CAP1_CH1     = (((uint32_t)0x1) << 13), /*!< The Channel 1 CCR1 capture condition occured. */
    TIMER_STATUS_CCR_CAP1_CH2     = (((uint32_t)0x1) << 14), /*!< The Channel 2 CCR1 capture condition occured. */
    TIMER_STATUS_CCR_CAP1_CH3     = (((uint32_t)0x1) << 15), /*!< The Channel 3 CCR1 capture condition occured. */
    TIMER_STATUS_CCR_CAP1_CH4     = (((uint32_t)0x1) << 16)  /*!< The Channel 4 CCR1 capture condition occured. */
} TIMER_Status_Flags_TypeDef;

#define TIMER_STATUS_Msk            (TIMER_STATUS_CNT_ZERO         | \
                                     TIMER_STATUS_CNT_ARR          | \
                                     TIMER_STATUS_ETR_RISING_EDGE  | \
                                     TIMER_STATUS_ETR_FALLING_EDGE | \
                                     TIMER_STATUS_BRK              | \
                                     TIMER_STATUS_CCR_CAP_CH1      | \
                                     TIMER_STATUS_CCR_CAP_CH2      | \
                                     TIMER_STATUS_CCR_CAP_CH3      | \
                                     TIMER_STATUS_CCR_CAP_CH4      | \
                                     TIMER_STATUS_CCR_REF_CH1      | \
                                     TIMER_STATUS_CCR_REF_CH2      | \
                                     TIMER_STATUS_CCR_REF_CH3      | \
                                     TIMER_STATUS_CCR_REF_CH4      | \
                                     TIMER_STATUS_CCR_CAP1_CH1     | \
                                     TIMER_STATUS_CCR_CAP1_CH2     | \
                                     TIMER_STATUS_CCR_CAP1_CH3     | \
                                     TIMER_STATUS_CCR_CAP1_CH4)

#define IS_TIMER_STATUS_FLAG(FLAG)  (((FLAG) == TIMER_STATUS_CNT_ZERO        ) || \
                                     ((FLAG) == TIMER_STATUS_CNT_ARR         ) || \
                                     ((FLAG) == TIMER_STATUS_ETR_RISING_EDGE ) || \
                                     ((FLAG) == TIMER_STATUS_ETR_FALLING_EDGE) || \
                                     ((FLAG) == TIMER_STATUS_BRK             ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP_CH1     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP_CH2     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP_CH3     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP_CH4     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_REF_CH1     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_REF_CH2     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_REF_CH3     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_REF_CH4     ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP1_CH1    ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP1_CH2    ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP1_CH3    ) || \
                                     ((FLAG) == TIMER_STATUS_CCR_CAP1_CH4    ))

#define IS_TIMER_STATUS(STATUS)    (((STATUS) & TIMER_STATUS_Msk) == (STATUS))

#if defined (USE_MDR32F1QI)
/**
  * @brief TIMER DMA Channels
  * @note Available only for MCU MDR32F1QI
  */
typedef enum
{
    TIMER_DMA_Channel0 = ((uint32_t)0x04),
    TIMER_DMA_Channel1 = ((uint32_t)0x00),
    TIMER_DMA_Channel2 = ((uint32_t)0x01),
    TIMER_DMA_Channel3 = ((uint32_t)0x02),
    TIMER_DMA_Channel4 = ((uint32_t)0x03)
} TIMER_DMA_Channel_TypeDef;

#define IS_TIMER_DMA_Channel(DMA_Channel)   ((DMA_Channel == TIMER_DMA_Channel0) || \
                                             (DMA_Channel == TIMER_DMA_Channel1) || \
                                             (DMA_Channel == TIMER_DMA_Channel2) || \
                                             (DMA_Channel == TIMER_DMA_Channel3) || \
                                             (DMA_Channel == TIMER_DMA_Channel4))

#endif /* #if defined (USE_MDR32F1QI) */

/**
  * @brief TIMER Clock BRG
  */
typedef enum
{
    TIMER_HCLKdiv1   = ((uint32_t)0x00),
    TIMER_HCLKdiv2   = ((uint32_t)0x01),
    TIMER_HCLKdiv4   = ((uint32_t)0x02),
    TIMER_HCLKdiv8   = ((uint32_t)0x03),
    TIMER_HCLKdiv16  = ((uint32_t)0x04),
    TIMER_HCLKdiv32  = ((uint32_t)0x05),
    TIMER_HCLKdiv64  = ((uint32_t)0x06),
    TIMER_HCLKdiv128 = ((uint32_t)0x07)
} TIMER_Clock_BRG_TypeDef;

#define IS_TIMER_CLOCK_BRG(BRG) (((BRG) == TIMER_HCLKdiv1  ) || \
                                 ((BRG) == TIMER_HCLKdiv2  ) || \
                                 ((BRG) == TIMER_HCLKdiv4  ) || \
                                 ((BRG) == TIMER_HCLKdiv8  ) || \
                                 ((BRG) == TIMER_HCLKdiv16 ) || \
                                 ((BRG) == TIMER_HCLKdiv32 ) || \
                                 ((BRG) == TIMER_HCLKdiv64 ) || \
                                 ((BRG) == TIMER_HCLKdiv128))


/**
  * @brief TIMER Counter Init structure definition
  */
typedef struct
{
#if defined(USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    uint16_t TIMER_IniCounter;       /*!< Specifies the initial counter value.
                                          This parameter can be a number between 0x0000 and 0xFFFF. */
#elif defined (USE_MDR32F1QI)
    uint32_t TIMER_IniCounter;       /*!< Specifies the initial counter value.
                                          This parameter can be a number between 0x0000 and 0xFFFFFFFF. */
#endif
    uint16_t TIMER_Prescaler;        /*!< Specifies the prescaler value used to divide the TIMER clock.
                                          This parameter can be a number between 0x0000 and 0xFFFF.
                                          CLK = TIMER_CLK/(TIMER_Prescaler + 1) */
#if defined(USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    uint16_t TIMER_Period;           /*!< Specifies the period = ARR + 1 value to be loaded into the
                                          Auto-Reload Register (ARR) at the next update event.
                                          This parameter must be a number between 0x0000 and 0xFFFF.  */
#elif defined (USE_MDR32F1QI)
    uint32_t TIMER_Period;           /*!< Specifies the period = ARR + 1 value to be loaded into the
                                          Auto-Reload Register (ARR) at the next update event.
                                          This parameter must be a number between 0x0000 and 0xFFFFFFFF.  */
#endif
    uint16_t TIMER_CounterMode;      /*!< Specifies the counter mode.
                                          This parameter can be a value of @ref TIMER_Counter_Mode_TypeDef */
    uint16_t TIMER_CounterDirection; /*!< Specifies the counter direction.
                                          This parameter can be a value of @ref TIMER_Counter_Dir_TypeDef */
    uint16_t TIMER_EventSource;      /*!< Specifies the Counter Event source.
                                          This parameter can be a value of @ref TIMER_Event_Src_TypeDef */
    uint16_t TIMER_FilterSampling;   /*!< Specifies the filter sampling clock (FDTS).
                                          This parameter can be a value of @ref TIMER_Filter_Sampl_Clk_TypeDef */
    uint16_t TIMER_ARR_UpdateMode;   /*!< Specifies the Auto-Reload Register (ARR) updating mode.
                                          This parameter can be a value of @ref TIMER_ARR_Update_Mode_TypeDef */
    uint16_t TIMER_ETR_FilterConf;   /*!< Specifies the ETR Filter configuration.
                                          This parameter can be a value of @ref TIMER_Filter_Config_TypeDef */
    uint16_t TIMER_ETR_Prescaler;    /*!< Specifies the ETR Prescaler configuration.
                                          This parameter can be a value of @ref TIMER_ETR_Prescaler_TypeDef */
    uint16_t TIMER_ETR_Polarity;     /*!< Specifies the ETR Polarity configuration.
                                          This parameter can be a value of @ref TIMER_ETR_Polarity_TypeDef */
    uint16_t TIMER_BRK_Polarity;     /*!< Specifies the BRK Polarity configuration.
                                          This parameter can be a value of @ref TIMER_BRK_Polarity_TypeDef */
} TIMER_CntInitTypeDef;

/**
  * @brief TIMER Channel Init structure definition
  */
typedef struct
{
    uint16_t TIMER_CH_Number;           /*!< Specifies the TIMER Channel number to be configured.
                                             This parameter can be a value of @ref TIMER_Channel_Number_TypeDef */
    uint16_t TIMER_CH_Mode;             /*!< Specifies the TIMER Channel mode.
                                             This parameter can be a value of @ref TIMER_CH_Mode_TypeDef */
    uint16_t TIMER_CH_ETR_Ena;          /*!< Enables or disables ETR.
                                             This parameter can be a value of @ref FunctionalState */
    uint16_t TIMER_CH_ETR_Reset;        /*!< Enables or disables ETR Reset.
                                             This parameter can be a value of @ref TIMER_CH_ETR_RESET_TypeDef */
    uint16_t TIMER_CH_BRK_Reset;        /*!< Enables or disables BRK Reset.
                                             This parameter can be a value of @ref TIMER_CH_BRK_RESET_TypeDef */
    uint16_t TIMER_CH_REF_Format;       /*!< Specifies the REF signal format.
                                             This parameter can be a value of @ref TIMER_CH_REF_Format_TypeDef */
    uint16_t TIMER_CH_Prescaler;        /*!< Specifies the TIMER Channel Prescaler configuration.
                                             This parameter can be a value of @ref TIMER_CH_Prescaler_TypeDef */
    uint16_t TIMER_CH_EventSource;      /*!< Specifies the Channel Event source.
                                             This parameter can be a value of @ref TIMER_CH_Event_Src_TypeDef */
    uint16_t TIMER_CH_FilterConf;       /*!< Specifies the TIMER Channel Filter configuration.
                                             This parameter can be a value of @ref TIMER_Filter_Config_TypeDef */
    uint16_t TIMER_CH_CCR_UpdateMode;   /*!< Specifies the TIMER CCR, CCR1 update mode.
                                             This parameter can be a value of @ref TIMER_CH_CCR_Update_Mode_TypeDef */
    uint16_t TIMER_CH_CCR1_Ena;         /*!< Enables or disables the CCR1 register.
                                             This parameter can be a value of @ref FunctionalState */
    uint16_t TIMER_CH_CCR1_EventSource; /*!< Specifies the Channel CCR1 Event source.
                                             This parameter can be a value of @ref TIMER_CH_CCR1_Event_Src_TypeDef */
} TIMER_ChnInitTypeDef;

/**
  * @brief TIMER Channel Output Init structure definition
  */
typedef struct
{
    uint16_t TIMER_CH_Number;            /*!< Specifies the TIMER Channel number to be configured.
                                              This parameter can be a value of @ref TIMER_Channel_Number_TypeDef */
    uint16_t TIMER_CH_DirOut_Polarity;   /*!< Specifies the TIMER CHx output polarity.
                                              This parameter can be a value of @ref TIMER_CH_OUT_Polarity_TypeDef */
    uint16_t TIMER_CH_DirOut_Source;     /*!< Specifies the TIMER CHx output source.
                                              This parameter can be a value of @ref TIMER_CH_OUT_Src_TypeDef */
    uint16_t TIMER_CH_DirOut_Mode;       /*!< Specifies the TIMER CHx output enable source.
                                              This parameter can be a value of @ref TIMER_CH_OUT_Mode_TypeDef */
    uint16_t TIMER_CH_NegOut_Polarity;   /*!< Enables or disables the TIMER CHxN output inversion.
                                              This parameter can be a value of @ref TIMER_CH_OUT_Polarity_TypeDef */
    uint16_t TIMER_CH_NegOut_Source;     /*!< Specifies the TIMER CHxN output source.
                                              This parameter can be a value of @ref TIMER_CH_OUT_Src_TypeDef */
    uint16_t TIMER_CH_NegOut_Mode;       /*!< Specifies the TIMER CHxN output enable source.
                                              This parameter can be a value of @ref TIMER_CH_OUT_Mode_TypeDef */
    uint16_t TIMER_CH_DTG_MainPrescaler; /*!< Specifies the main prescaler of TIMER DTG.
                                              This parameter can be a number between 0x0000 and 0x00FF.
                                              Delay DTGdel = TIMER_CH_DTG_MainPrescaler*(TIMER_CH_DTG_AuxPrescaler + 1) clocks. */
    uint16_t TIMER_CH_DTG_AuxPrescaler;  /*!< Specifies the auxiliary prescaler of TIMER DTG.
                                              This parameter can be a number between 0x0000 and 0x000F.
                                              Delay DTGdel = TIMER_CH_DTG_MainPrescaler*(TIMER_CH_DTG_AuxPrescaler + 1) clocks. */
    uint16_t TIMER_CH_DTG_ClockSource;   /*!< Specifies the TIMER DTG clock source.
                                              This parameter can be a value of @ref TIMER_CH_DTG_Clk_Src_TypeDef */
} TIMER_ChnOutInitTypeDef;

/** @} */ /* End of group TIMER_Exported_Types */


/** @defgroup TIMER_Exported_Constants TIMER Exported Constants
  * @{
  */

/** @defgroup TIMER_CH_DTG_Prescaler TIMER Channel DTG Prescaler
  * @{
  */

#define IS_TIMER_CHANNEL_DTG_MAIN_PRESCALER(VALUE) (((VALUE) >> 8) == 0)

